% 車両モデル
% wv = 5.8;
wv = 2.5;%2.5
wp = wv;


ts_dvsp = 0.01;
numd_dvsp = [0.3579 0 -0.3579];
dend_dvsp = [1 -1.846 0.8535];


% 目標車間距離オフセット [m]
Th = 1.1;	dist_m = 0;		
wt = 0.6;% 0.3 1.0
zt = 1.7; % 0.8 2.5
Th1 = 1.2;
Th2 = 4.5;
dist_start_m = 0;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
% 初期値の設定
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 先行車の初期車速 [m/s]
vt_ini = 60/3.6;
% 初期車間 [m]
dist_ini = Th*vt_ini + dist_m + dist_start_m;

dist_ini_1 = Th*vt_ini + dist_m + dist_start_m;

dist_ini_2 = Th*vt_ini + dist_m + dist_start_m;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
% いろんなパラメータの設定
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
% 先行車速加減速に対する車間規範モデルの定数
%
a0 = wt*wt;
a1 = 2*zt*wt;
d0 = 1/wt/wt;
d1 = Th;
d2 = (2*zt - wt*Th)/wt/wp;
% d3 = 1/wp;

%
% 追いつき割り込みに対する車間規範モデルの定数
%
%wc = 0.16;zc = 0.8;
wc = 0.5;
zc = 2.5;
e0 = wc*wc;
e1 = 2*zc*wc;

%
% フィードバックゲイン
%
wfb = 0.4;%0.4  0.6
zfb = 1.0;  %1.0    2.5
fd = wfb*wfb/wp;
fv = 2*zfb*wfb/wp;

